---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewportPositioning.ViewOrigin
enum: Autodesk.Revit.DB.ViewportPositioning
source: html/ef1bc472-5074-ae92-0d7e-37367c03546b.htm
---
# Autodesk.Revit.DB.ViewportPositioning.ViewOrigin

When swapping to another view, the viewport location will be based on the view origin.